cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF12xS.svd
        <!-- REGISTER "TIMER1INTCLR" -->
        <register>
          <name>TIMER1INTCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "TIMER1RIS" -->
        <register>
          <name>TIMER1RIS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1RIS" -->
            <field>
              <name>TIMER1RIS</name>
              <description>Interrupt Status Register bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1MIS" -->
        <register>
          <name>TIMER1MIS</name>
          <description>Masked Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1MIS" -->
            <field>
              <name>TIMER1MIS</name>
              <description>Masked Interrupt Status bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1BGLOAD" -->
        <register>
          <name>TIMER1BGLOAD</name>
          <description>Background Load Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER2LOAD" -->
        <register derivedFrom="TIMER1LOAD">
          <name>TIMER2LOAD</name>
          <description>Load Register</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "TIMER2VALUE" -->
        <register derivedFrom="TIMER1VALUE">
          <name>TIMER2VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "TIMER2CONTROL" -->
        <register derivedFrom="TIMER1CONTROL">
          <name>TIMER2CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "TIMER2INTCLR" -->
        <register derivedFrom="TIMER1INTCLR">
          <name>TIMER2INTCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "TIMER2RIS" -->
        <register derivedFrom="TIMER1RIS">
          <name>TIMER2RIS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "TIMER2MIS" -->
        <register derivedFrom="TIMER1MIS">
          <name>TIMER2MIS</name>
          <description>Masked Interrupt Status Register</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TIMER2BGLOAD" -->
        <register derivedFrom="TIMER1BGLOAD">
          <name>TIMER2BGLOAD</name>
          <description>Background Load Register</description>
          <addressOffset>0x38</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFT0" -->
    <peripheral>
      <name>MFT0</name>
      <description>Multifunction Timer 0</description>
      <groupName>MFT0</groupName>
      <baseAddress>0x40020000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x48</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x54</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x68</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x6C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x74</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x78</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x84</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x88</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x94</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x98</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xAC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xBC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "WFG" -->
      <interrupt>
        <name>WFG</name>
        <value>3</value>
      </interrupt>
      <!-- INTERRUPT "FRTIM" -->
      <interrupt>
        <name>FRTIM</name>
        <value>28</value>
      </interrupt>
      <!-- INTERRUPT "INCAP" -->
      <interrupt>
        <name>INCAP</name>
        <value>29</value>
      </interrupt>
      <!-- INTERRUPT "OUTCOMP" -->
      <interrupt>
        <name>OUTCOMP</name>
        <value>30</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRT_TCSA0" -->
        <register>
          <name>FRT_TCSA0</name>
          <description>FRT-ch.0 Control Register A</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0040</resetValue>
          <resetMask>0xE3FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK" -->
            <field>
              <name>CLK</name>
              <description>FRT clock cycle</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLR" -->
            <field>
              <name>SCLR</name>
              <description>FRT operation state initialization request</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "MODE" -->
            <field>
              <name>MODE</name>
              <description>FRT's count mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STOP" -->
            <field>
              <name>STOP</name>
              <description>Puts FRT in stopping state</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BFE" -->
            <field>
              <name>BFE</name>
              <description>Enables TCCP's buffer function</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICRE" -->
            <field>
              <name>ICRE</name>
              <description>"Generates interrupt when ""1"" is set to TCSA.ICLR"</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ICLR" -->
            <field>
              <name>ICLR</name>
              <description>interrupt flag</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZE" -->
            <field>
              <name>IRQZE</name>
              <description>"Generates interrupt, when ""1"" is set to TCSA.IRQZF"</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IRQZF" -->
            <field>
              <name>IRQZF</name>
              <description>zero interrupt flag</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECKE" -->
            <field>
              <name>ECKE</name>
              <description>Uses an external input clock (FRCK) as FRT's count clock</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCSA1" -->
        <register derivedFrom="FRT_TCSA0">
          <name>FRT_TCSA1</name>
          <description>FRT-ch.1 Control Register A</description>
          <addressOffset>0x40</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCSA2" -->
        <register derivedFrom="FRT_TCSA0">
          <name>FRT_TCSA2</name>
          <description>FRT-ch.2 Control Register A</description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCSB0" -->
        <register>
          <name>FRT_TCSB0</name>
          <description>FRT-ch.0 Control Register B</description>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AD0E" -->
            <field>
              <name>AD0E</name>
              <description>Outputs AD conversion start signal to ADCunit0 upon Zero value detection by FRT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FRT_TCSB1" -->
        <register derivedFrom="FRT_TCSB0">
          <name>FRT_TCSB1</name>
          <description>FRT-ch.1 Control Register B</description>
          <addressOffset>0x44</addressOffset>
        </register>
