cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF12xS.svd
        <!-- REGISTER "PFRF" -->
        <register>
          <name>PFRF</name>
          <description>Port function setting register F</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000060</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of PFRF</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of PFRF</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description>Pull-up Setting Register 5</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description>Pull-up Setting Register 6</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description>Pull-up Setting Register 7</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description>Pull-up Setting Register 8</description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCR9" -->
        <register derivedFrom="PFR9">
          <name>PCR9</name>
          <description>Pull-up Setting Register 9</description>
          <addressOffset>0x124</addressOffset>
        </register>
        <!-- REGISTER "PCRA" -->
        <register derivedFrom="PFRA">
          <name>PCRA</name>
          <description>Pull-up Setting Register A</description>
          <addressOffset>0x128</addressOffset>
        </register>
        <!-- REGISTER "PCRB" -->
        <register derivedFrom="PFRB">
          <name>PCRB</name>
          <description>Pull-up Setting Register B</description>
          <addressOffset>0x12C</addressOffset>
        </register>
        <!-- REGISTER "PCRC" -->
        <register derivedFrom="PFRC">
          <name>PCRC</name>
          <description>Pull-up Setting Register C</description>
          <addressOffset>0x130</addressOffset>
        </register>
        <!-- REGISTER "PCRD" -->
        <register derivedFrom="PFRD">
          <name>PCRD</name>
          <description>Pull-up Setting Register D</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "PCRF" -->
        <register derivedFrom="PFRF">
          <name>PCRF</name>
          <description>Pull-up Setting Register F</description>
          <addressOffset>0x13C</addressOffset>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description>Port input/output direction setting register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000003FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P9" -->
            <field>
              <name>P9</name>
              <description>Bit9 of DDR0</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P8" -->
            <field>
              <name>P8</name>
              <description>Bit8 of DDR0</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7" -->
            <field>
              <name>P7</name>
              <description>Bit7 of DDR0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6" -->
            <field>
              <name>P6</name>
              <description>Bit6 of DDR0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5" -->
            <field>
              <name>P5</name>
              <description>Bit5 of DDR0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P4" -->
            <field>
              <name>P4</name>
              <description>Bit4 of DDR0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of DDR0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of DDR0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P1" -->
            <field>
              <name>P1</name>
              <description>Bit1 of DDR0</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of DDR0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register derivedFrom="PFR1">
          <name>DDR1</name>
          <description>Port input/output direction setting register 1</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "DDR2" -->
        <register derivedFrom="PFR2">
          <name>DDR2</name>
          <description>Port input/output direction setting register 2</description>
          <addressOffset>0x208</addressOffset>
        </register>
        <!-- REGISTER "DDR3" -->
        <register derivedFrom="PFR3">
          <name>DDR3</name>
          <description>Port input/output direction setting register 3</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "DDR4" -->
        <register derivedFrom="PFR4">
          <name>DDR4</name>
          <description>Port input/output direction setting register 4</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "DDR5" -->
        <register derivedFrom="PFR5">
          <name>DDR5</name>
          <description>Port input/output direction setting register 5</description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "DDR6" -->
        <register derivedFrom="PFR6">
          <name>DDR6</name>
          <description>Port input/output direction setting register 6</description>
          <addressOffset>0x218</addressOffset>
        </register>
